Documents/ВыдачаКниг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ВыдачаКниг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Читатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Читатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокКниг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Книга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Книги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стелаж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Стелажи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Полка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОсвтаткиКнигНаПолках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ОсвтаткиКнигНаПолках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Книга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Книги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Стелаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стелажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Полка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВыдачаКниг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокКнигКнигаПриИзменении(Элемент)  
	ТекущаяСтрока = Элементы.СписокКниг.ТекущиеДанные;
	ДанныеХраненияКниги = ПолучитьСтелажиИПолки(ТекущаяСтрока.Книга); 	
	Если ДанныеХраненияКниги.Стелаж = Неопределено Тогда 
		Элементы.СписокКниг.ЗакончитьРедактированиеСтроки(Истина);   
		ПоказатьПредупреждение(,"Данной книги нет в наличии!", 0, "Внимавние" );
	Возврат;
КонецЕсли;   
	ТекущаяСтрока.Стелаж = ДанныеХраненияКниги.Стелаж;
	ТекущаяСтрока.Полка  = ДанныеХраненияКниги.Полка;
	
КонецПроцедуры

// Функция - Получает информацию на коком Стелаже и на 
//   какой полке находится книга
// Параметры:
//  Книга	 - Справочник "Книги"
// 
// Возвращаемое значение:
//  Структура - Содержит Стелаж и полку 
//
&НаСервере
Функция ПолучитьСтелажиИПолки(Книга)

  ДанныеХраненияКниги = Новый  Структура("Стелаж, Полка"); 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсвтаткиКнигНаПолкахОстатки.Стелаж КАК Стелаж,
		|	ОсвтаткиКнигНаПолкахОстатки.Полка КАК Полка
		|ИЗ
		|	РегистрНакопления.ОсвтаткиКнигНаПолках.Остатки(, Книга = &Книга) КАК ОсвтаткиКнигНаПолкахОстатки
		|ГДЕ
		|	ОсвтаткиКнигНаПолкахОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("Книга", Книга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеХраненияКниги, ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
	Возврат ДанныеХраненияКниги;
		
КонецФункции  


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Сотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
		Объект.Сотрудник = ОбщегоНазначенияСервер.ПолучитьСотрудникаПоТекущемуПользователю();  
	КонецЕсли;
КонецПроцедуры
